## MINI PROJECT 1

## READ THE DATA

In [3]:
import pandas as pd
df=pd.read_excel(r"C:\Users\Tulasi\OneDrive\Desktop\weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

## EXPLORING THE DATA

In [4]:
df.head()

        Date      City  Temperature_C  Humidity_% Condition
0 2025-01-01  Hyderbad             28          60     Sunny
1 2025-01-02  Hyderbad             29          62     Sunny
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [5]:
df.head(10)

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [6]:
df.tail()

        Date        City  Temperature_C  Humidity_% Condition
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [7]:
df.tail(7)

        Date        City  Temperature_C  Humidity_% Condition
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           10 non-null     datetime64[ns]
 1   City           10 non-null     object
 2   Temperature_C  10 non-null     int64
 3   Humidity_%     10 non-null     int64
 4   Condition      10 non-null     object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 532.0+ bytes

In [9]:
df.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Condition'], dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [11]:
df.dtypes

Date             datetime64[ns]
City                     object
Temperature_C             int64
Humidity_%                int64
Condition                object
dtype: object

In [12]:
df.Date

0   2025-01-01
1   2025-01-02
2   2025-01-03
3   2025-01-04
4   2025-01-05
5   2025-01-06
6   2025-01-07
7   2025-01-08
8   2025-01-09
9   2025-01-10
Name: Date, dtype: datetime64[ns]

In [13]:
df.City

0      Hyderbad
1      Hyderbad
2      Hyderbad
3      Hyderbad
4      Banglore
5      Banglore
6      Banglore
7      Banglore
8    Vijayawada
9    Vijayawada
Name: City, dtype: object

In [14]:
df.shape

(10, 5)

In [15]:
df[2:5]

        Date      City  Temperature_C  Humidity_% Condition
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [16]:
df[['Date','Condition']]

        Date Condition
0 2025-01-01     Sunny
1 2025-01-02     Sunny
2 2025-01-03    Cloudy
3 2025-01-04    Cloudy
4 2025-01-05     Rainy
5 2025-01-06     Rainy
6 2025-01-07     Sunny
7 2025-01-08    Cloudy
8 2025-01-09     Rainy
9 2025-01-10     Sunny

In [17]:
Data={
    'Name':['Tulasi','vijju','chaithu','manasa','moina','vinni','vennela','grahi'],
     'Marks':[100,99,98,95,96,99,98,88],
    'Location':['kkd','vjy','akp','kkd','kkd','rjy','rjy','vzg']
}
df=pd.DataFrame(Data)
df

      Name  Marks Location
0   Tulasi    100      kkd
1    vijju     99      vjy
2  chaithu     98      akp
3   manasa     95      kkd
4    moina     96      kkd
5    vinni     99      rjy
6  vennela     98      rjy
7    grahi     88      vzg

In [18]:
df.head()

      Name  Marks Location
0   Tulasi    100      kkd
1    vijju     99      vjy
2  chaithu     98      akp
3   manasa     95      kkd
4    moina     96      kkd

In [19]:
df.head(6)

      Name  Marks Location
0   Tulasi    100      kkd
1    vijju     99      vjy
2  chaithu     98      akp
3   manasa     95      kkd
4    moina     96      kkd
5    vinni     99      rjy

In [20]:
df.tail()

      Name  Marks Location
3   manasa     95      kkd
4    moina     96      kkd
5    vinni     99      rjy
6  vennela     98      rjy
7    grahi     88      vzg

In [21]:
df.tail(4)

      Name  Marks Location
4    moina     96      kkd
5    vinni     99      rjy
6  vennela     98      rjy
7    grahi     88      vzg

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      8 non-null      object
 1   Marks     8 non-null      int64
 2   Location  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [23]:
df.columns

Index(['Name', 'Marks', 'Location'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [25]:
df.dtypes

Name        object
Marks        int64
Location    object
dtype: object

In [26]:
df.Name

0     Tulasi
1      vijju
2    chaithu
3     manasa
4      moina
5      vinni
6    vennela
7      grahi
Name: Name, dtype: object

In [27]:
df.Location

0    kkd
1    vjy
2    akp
3    kkd
4    kkd
5    rjy
6    rjy
7    vzg
Name: Location, dtype: object

In [28]:
df.shape

(8, 3)

In [29]:
df[2:5]

      Name  Marks Location
2  chaithu     98      akp
3   manasa     95      kkd
4    moina     96      kkd

In [30]:
df[['Name','Location']]

      Name Location
0   Tulasi      kkd
1    vijju      vjy
2  chaithu      akp
3   manasa      kkd
4    moina      kkd
5    vinni      rjy
6  vennela      rjy
7    grahi      vzg

In [31]:
df[['Name','Marks']]

      Name  Marks
0   Tulasi    100
1    vijju     99
2  chaithu     98
3   manasa     95
4    moina     96
5    vinni     99
6  vennela     98
7    grahi     88